Repository: AhmedAbdElrahman117/uccd
Catalog: lib/l10n/intl_*.arb
Languages: ar_eg, ko

# splashText
source: University Center for Career Development
ar_eg: المركز الجامعي للتطوير المهني
ko: 대학 경력 개발 센터

# splashLoading
source: Loading...
ar_eg: جاري التحميل...
ko: 로딩중...

source: Welcome to
ar_eg: أهلاً بك في
ko: 환영합니다

# loginButton
source: Login
ar_eg: تسجيل الدخول
ko: 로그인

source: Contact Support
ar_eg: تواصل مع الدعم
ko: 지원팀 문의

# orDivider
source: or
ar_eg: أو
ko: 또는

source: UCCD Mobile App
ar_eg: تطبيق UCCD
ko: UCCD 모바일 앱

# versionNumber
source: Version 1.0.0
ar_eg: الإصدار 1.0.0
ko: 버전 1.0.0

source: University Email
ar_eg: البريد الجامعي
ko: 대학 이메일

# universityEmailHint
source: Enter your University Email
ar_eg: أدخل بريدك الجامعي
ko: 대학 이메일을 입력하세요

source: Password
ar_eg: كلمة المرور
ko: 비밀번호

# passwordHint
source: Enter your Password
ar_eg: أدخل كلمة المرور
ko: 비밀번호를 입력하세요

# emailRequired
source: Email field is required
ar_eg: حقل البريد الإلكتروني مطلوب
ko: 이메일 필드는 필수입니다

# invalidEmail
source: Please enter a valid email address
ar_eg: من فضلك أدخل عنوان بريد إلكتروني صحيح
ko: 유효한 이메일 주소를 입력하세요

# onlyBtuEmail
source: Only BTU university emails (@btu.edu.eg) are allowed
ar_eg: فقط بريد جامعة BTU (@btu.edu.eg) مسموح
ko: BTU 대학 이메일(@btu.edu.eg)만 허용됩니다

# emailUsernameTooShort
source: Email username must be at least 3 characters
ar_eg: اسم المستخدم في البريد يجب أن يكون 3 أحرف على الأقل
ko: 이메일 사용자명은 최소 3자 이상이어야 합니다

source: Student Interests
ar_eg: اهتمامات الطالب
ko: 학생 관심사

# studentInterestsDescription
source: What Categories of Courses or Fields you are interested in
ar_eg: ما هي فئات الدورات التي تهتم بها
ko: 관심 있는 과정 또는 분야 카테고리는 무엇입니까

source: Student Info
ar_eg: بيانات الطالب
ko: 학생 정보

# studentInfoDescription
source: Let's Start by Providing us with some info
ar_eg: لنبدأ بتقديم بعض المعلومات عنك
ko: 몇 가지 정보를 제공하는 것부터 시작하겠습니다

# phoneNumber
source: Phone
ar_eg: الهاتف
ko: 전화번호

# phoneNumberHint
source: Enter your Phone Number
ar_eg: أدخل رقم هاتفك
ko: 전화번호를 입력하세요

source: Required Field
ar_eg: حقل مطلوب
ko: 필수 필드

# phoneNumberTooShort
source: Phone Number are less Than 11 Numbers
ar_eg: رقم الهاتف أقل من 11 رقم
ko: 전화번호가 11자리보다 적습니다

source: Invalid Phone Number
ar_eg: رقم هاتف غير صحيح
ko: 유효하지 않은 전화번호

source: Graduation year
ar_eg: سنة التخرج
ko: 졸업년도

# graduationYearHint
source: Enter your Expected Graduation year
ar_eg: أدخل سنة التخرج المتوقعة
ko: 예상 졸업년도를 입력하세요

source: Date Required
ar_eg: التاريخ مطلوب
ko: 날짜 필수

# graduationYearIncorrect
source: Graduation year is Incorrect
ar_eg: سنة التخرج غير صحيحة
ko: 졸업년도가 올바르지 않습니다

# verificationEmailSent
source: We Sent a Verification Email to
ar_eg: لقد أرسلنا بريد تحقق إلى
ko: 인증 이메일을 다음 주소로 보냈습니다

# verificationEmailInbox
source: with an OTP Number please Check your Inbox
ar_eg: مع رمز OTP، يرجى التحقق من صندوق الوارد
ko: 오티피 번호와 함께, 받은 편지함을 확인하세요

source: OTP Verification
ar_eg: تحقق OTP
ko: 오티피

# didntRecieveCode
source: Didn't receive a code?
ar_eg: لم تستلم الرمز؟
ko: 코드를 받지 못하셨나요?

# rensendCode
source: Resend Code
ar_eg: إعادة إرسال الرمز
ko: 렌센드코드

source: Disability
ar_eg: إعاقة
ko: 무능

source: Yes
ar_eg: نعم
ko: 예

source: No
ar_eg: لا
ko: 아니요

source: Next
ar_eg: التالي
ko: 다음

source: Back
ar_eg: العودة
ko: 뒤쪽에

source: Submit
ar_eg: إرسال
ko: 제출하다

source: Terms and Conditions
ar_eg: الشروط والأحكام
ko: 이용약관

# readTerms
source: Please Read Terms and Condition Carefully before Proceed in
ar_eg: يرجى قراءة الشروط والأحكام بعناية قبل المتابعة
ko: 진행하기 전에 이용 약관을 주의 깊게 읽어주세요.

# TermsText1
source: I agree and authorize the UCCD to use my data and my photographs taken during my participation in the training programs and/or career development service offered by the center for the purposes of UCCD reporting, publications, and employer networking
ar_eg: أوافق وأفوض مركز UCCD باستخدام بياناتي وصوري التي التقطتها أثناء مشاركتي في برامج التدريب و/أو خدمة التطوير المهني التي يقدمها المركز لأغراض إعداد التقارير والمنشورات والتواصل مع أصحاب العمل في مركز UCCD
ko: 저는 UCCD가 UCCD 보고, 출판 및 고용주 네트워킹 목적으로 센터에서 제공하는 교육 프로그램 및/또는 경력 개발 서비스에 참여하는 동안 촬영한 데이터와 사진을 사용하는 것에 동의하고 이를 승인합니다.

# TermsText2
source: and authorizing UCCD app to collect Data about my participation in courses for analysis and improving user Experience
ar_eg: وتفويض تطبيق UCCD بجمع البيانات حول مشاركتي في الدورات التدريبية للتحليل وتحسين تجربة المستخدم
ko: 그리고 UCCD 앱이 분석 및 사용자 경험 개선을 위해 내 코스 참여에 대한 데이터를 수집하도록 승인합니다.

source: I Agree
ar_eg: أوافق
ko: 동의합니다

# onTerms
source: on Terms and Condition of UCCD Center
ar_eg: على الشروط والأحكام لمركز UCCD
ko: UCCD 센터 이용 약관에 관하여

source: Home
ar_eg: الرئيسية
ko: 홈

source: Courses
ar_eg: الدورات
ko: 과정

source: My Courses
ar_eg: دوراتي
ko: 내 과정

source: Community
ar_eg: المجتمع
ko: 커뮤니티

source: Profile
ar_eg: الملف الشخصي
ko: 프로필

source: Assigned Courses
ar_eg: الدورات المعينة
ko: 할당된 과정

source: No courses assigned yet
ar_eg: لم يتم تعيين دورات بعد
ko: 아직 할당된 과정이 없습니다

# coursesWillAppearAssigned
source: Courses will appear here once they are assigned to you
ar_eg: ستظهر الدورات هنا بمجرد تعيينها لك
ko: 과정이 할당되면 여기에 표시됩니다

source: Error loading courses
ar_eg: خطأ في تحميل الدورات
ko: 과정 로딩 오류

source: Quick Actions
ar_eg: الإجراءات السريعة
ko: 빠른 작업

source: Add Course
ar_eg: إضافة دورة
ko: 과정 추가

source: Create new course
ar_eg: إنشاء دورة جديدة
ko: 새 과정 만들기

source: Add Category
ar_eg: إضافة فئة
ko: 카테고리 추가

source: Manage categories
ar_eg: إدارة الفئات
ko: 카테고리 관리

source: Add Post
ar_eg: إضافة منشور
ko: 게시물 추가

source: Community post
ar_eg: منشور المجتمع
ko: 커뮤니티 게시물

source: Add Instructor
ar_eg: إضافة مدرب
ko: 강사 추가

source: New instructor
ar_eg: مدرب جديد
ko: 새 강사

source: Add Student
ar_eg: إضافة طالب
ko: 학생 추가

source: Register student
ar_eg: تسجيل طالب
ko: 학생 등록

source: Actions
ar_eg: إجراءات
ko: 작업

source: Admin Dashboard
ar_eg: لوحة تحكم المشرف
ko: 관리자 대시보드

source: Welcome back,
ar_eg: أهلاً بعودتك،
ko: 환영합니다,

source: Admin
ar_eg: مشرف
ko: 관리자

source: Total Courses
ar_eg: إجمالي الدورات
ko: 총 과정 수

source: Active Students
ar_eg: الطلاب النشطين
ko: 활성 학생

source: Students By year
ar_eg: الطلاب حسب السنة
ko: 연도별 학생

source: Students By Departments
ar_eg: الطلاب حسب الأقسام
ko: 부서별 학생

# studentsByDepartmentAndYear
source: Students By Department & year
ar_eg: الطلاب حسب القسم والسنة
ko: 부서 및 연도별 학생

# changeInstructor
source: Change Instrcutor
ar_eg: تغيير المدرب
ko: 강사 변경

source: Change
ar_eg: تغيير
ko: 변경

source: Interview
ar_eg: المقابلة
ko: 인터뷰

source: Statistics
ar_eg: الإحصائيات
ko: 통계

source: Change Category
ar_eg: تغيير الفئة
ko: 카테고리 변경

source: Retry
ar_eg: إعادة المحاولة
ko: 재시도

source: Multiple Check
ar_eg: اختيار متعدد
ko: 다중 체크

source: Dashboard
ar_eg: لوحة التحكم
ko: 대시보드

source: Admins
ar_eg: المشرفين
ko: 관리자들

source: Categories
ar_eg: الفئات
ko: 카테고리들

source: Instructors
ar_eg: المدربين
ko: 강사들

source: Course Analytics
ar_eg: تحليلات الدورة
ko: 과정 분석

source: Settings
ar_eg: الإعدادات
ko: 설정

source: Dashboard Overview
ar_eg: نظرة عامة على لوحة التحكم
ko: 대시보드 개요

source: Course
ar_eg: الدورة
ko: 과정

source: Reject
ar_eg: رفض
ko: 거부

source: Live Data
ar_eg: بيانات حية
ko: 라이브 데이터

source: System configuration
ar_eg: إعدادات النظام
ko: 시스템 구성

source: Courses Management
ar_eg: إدارة الدورات
ko: 과정 관리

source: Students
ar_eg: الطلاب
ko: 학생들

source: Send Notification
ar_eg: إرسال إشعار
ko: 알림 보내기

source: Send All
ar_eg: إرسال للجميع
ko: 모두 보내기

source: Ratings
ar_eg: التقييمات
ko: 평점

source: Accept
ar_eg: قبول
ko: 수락

source: Edit
ar_eg: تعديل
ko: 편집

source: Delete
ar_eg: حذف
ko: 삭제

source: No Accepted Students
ar_eg: لا يوجد طلاب مقبولين
ko: 승인된 학생이 없습니다

source: Attend
ar_eg: الحضور
ko: 출석

source: Absent
ar_eg: الغياب
ko: 결석

source: Invalid Course Dates
ar_eg: تواريخ الدورة غير صحيحة
ko: 유효하지 않은 코스 날짜

source: Invalid Interview Dates
ar_eg: تواريخ المقابلة غير صحيحة
ko: 유효하지 않은 인터뷰 날짜

# interviewDatesBeforeCourseDates
source: Interview Dates must be before Course Dates
ar_eg: يجب أن تكون تواريخ المقابلة قبل تواريخ الدورة
ko: 인터뷰 날짜는 코스 날짜보다 이전이어야 합니다

source: Max Accepted Students
ar_eg: الحد الأقصى للطلاب المقبولين
ko: 최대 승인 학생 수

source: Enter Max Accepted Students
ar_eg: أدخل الحد الأقصى للطلاب المقبولين
ko: 최대 승인 학생 수 입력

source: Enter Interview Start Date
ar_eg: أدخل تاريخ بداية المقابلة
ko: 인터뷰 시작 날짜 입력

source: Enter Interview End Date
ar_eg: أدخل تاريخ نهاية المقابلة
ko: 인터뷰 종료 날짜 입력

source: Interview Start Date
ar_eg: تاريخ بداية المقابلة
ko: 인터뷰 시작 날짜

source: Interview End Date
ar_eg: تاريخ نهاية المقابلة
ko: 인터뷰 종료 날짜

source: Start Date Required
ar_eg: تاريخ البداية مطلوب
ko: 시작 날짜 필수

source: End Date Required
ar_eg: تاريخ النهاية مطلوب
ko: 종료 날짜 필수

# interviewStartDateBeforeEndDate
source: Interview Start Date must be before End Date
ar_eg: يجب أن يكون تاريخ بداية المقابلة قبل تاريخ النهاية
ko: 인터뷰 시작 날짜는 종료 날짜보다 이전이어야 합니다

# interviewEndDateAfterStartDate
source: Interview End Date must be after Start Date
ar_eg: يجب أن يكون تاريخ نهاية المقابلة بعد تاريخ البداية
ko: 인터뷰 종료 날짜는 시작 날짜보다 이후여야 합니다

# interviewStartDateBeforeCourses
source: Interview Start Date must be Before Courses
ar_eg: يجب أن يكون تاريخ بداية المقابلة قبل الدورات
ko: 인터뷰 시작 날짜는 코스보다 이전이어야 합니다

# interviewEndDateBeforeCourses
source: Interview End Date must be Before Courses
ar_eg: يجب أن يكون تاريخ نهاية المقابلة قبل الدورات
ko: 인터뷰 종료 날짜는 코스보다 이전이어야 합니다

# availableCourses
source: Available
ar_eg: المتاحة
ko: 사용 가능

# archivedCourses
source: Archived
ar_eg: المؤرشفة
ko: 보관소

# ManageCourses
source: Manage Course
ar_eg: إدارة الدورة
ko: 과정 관리

source: Archived
ar_eg: مؤرشفة
ko: 보관됨

source: Active
ar_eg: نشط
ko: 활성

source: Student
ar_eg: طالب
ko: 학생

source: Control Panel
ar_eg: لوحة التحكم
ko: 제어판

source: All
ar_eg: الكل
ko: 전체

source: Pending
ar_eg: في الانتظار
ko: 대기 중

source: Accepted
ar_eg: مقبول
ko: 승인됨

source: Rejected
ar_eg: مرفوض
ko: 거부됨

source: Student Accepted Successfully
ar_eg: تم قبول الطالب بنجاح
ko: 학생이 성공적으로 승인되었습니다

source: Enrollments
ar_eg: التسجيلات
ko: 등록

source: Available
ar_eg: المتاح
ko: 사용 가능

source: Total Students
ar_eg: إجمالي الطلاب
ko: 총 학생 수

source: No Students to Interview
ar_eg: لا يوجد طلاب للمقابلة
ko: 인터뷰할 학생이 없습니다

# statisticsButtonTitle
source: Statistics
ar_eg: الإحصائيات
ko: 통계

# statisticsButtonTooltip
source: View course statistics and analytics
ar_eg: عرض إحصائيات وتحليلات الدورة
ko: 과정 통계 및 분석 보기

# statisticsButtonSemanticLabel
source: View statistics for {courseName}
ar_eg: عرض إحصائيات {courseName}
ko: {courseName} 통계 보기

# interviewButtonTitle
source: Interview
ar_eg: المقابلة
ko: 인터뷰

# interviewButtonTooltip
source: Manage course interviews and applications
ar_eg: إدارة مقابلات وطلبات الدورة
ko: 과정 인터뷰 및 지원서 관리

# interviewButtonSemanticLabel
source: Manage interviews for {courseName}
ar_eg: إدارة مقابلات {courseName}
ko: {courseName} 인터뷰 관리

# editButtonTitle
source: Edit
ar_eg: تعديل
ko: 편집

# editButtonTooltip
source: Edit course information and settings
ar_eg: تعديل معلومات وإعدادات الدورة
ko: 과정 정보 및 설정 편집

# editButtonSemanticLabel
source: Edit {courseName}
ar_eg: تعديل {courseName}
ko: {courseName} 편집

# changeInstructorButtonTitle
source: Change Instructor
ar_eg: تغيير المدرب
ko: 강사 변경

# changeInstructorButtonTooltip
source: Change course instructor
ar_eg: تغيير مدرب الدورة
ko: 과정 강사 변경

# changeInstructorButtonSemanticLabel
source: Change instructor for {courseName}
ar_eg: تغيير مدرب {courseName}
ko: {courseName} 강사 변경

# changeCategoryButtonTitle
source: Change Category
ar_eg: تغيير الفئة
ko: 카테고리 변경

# changeCategoryButtonTooltip
source: Change course category
ar_eg: تغيير فئة الدورة
ko: 과정 카테고리 변경

# changeCategoryButtonSemanticLabel
source: Change category for {courseName}
ar_eg: تغيير فئة {courseName}
ko: {courseName} 카테고리 변경

# deleteButtonTitle
source: Delete
ar_eg: حذف
ko: 삭제

# deleteButtonTooltip
source: Delete course permanently
ar_eg: حذف الدورة نهائياً
ko: 과정을 영구적으로 삭제

# deleteButtonSemanticLabel
source: Delete {courseName}
ar_eg: حذف {courseName}
ko: {courseName} 삭제

# deleteCourseConfirmMessage
source: Do you want to Delete {courseName} permanently?
ar_eg: هل تريد حذف {courseName} نهائياً؟
ko: {courseName}을(를) 영구적으로 삭제하시겠습니까?

# firstYear
source: 1st Year
ar_eg: السنة الاولى
ko: 첫 번째 년도

# secondYear
source: 2nd Year
ar_eg: السنة الثانية
ko: 둘 년도

# thirdYear
source: 3rd Year
ar_eg: السنة الثالثة
ko: 삼 년도

# fourthYear
source: 4th Year
ar_eg: السنة الرابعة
ko: 네 개 년도

# itDepartment
source: IT
ar_eg: تكنولوجيا المعلومات
ko: 정보기술

# mechaDepartment
source: Mecha
ar_eg: الميكاترونيكس
ko: 메카트로닉스

# autoDepartment
source: Auto
ar_eg: الأوتوترونيكس
ko: 오토트로닉스

# reDepartment
source: RE
ar_eg: الطاقة المتجددة
ko: 재생에너지

# opDepartment
source: O&P
ar_eg: الأطراف الصناعية
ko: 의지보조기

# addCourseTitle
source: Add Course
ar_eg: إضافة دورة
ko: 과정 추가

# editCourseTitle
source: Edit Course
ar_eg: تعديل دورة
ko: 과정 편집

source: Course Added Successfully
ar_eg: تم إضافة الدورة بنجاح
ko: 과정이 성공적으로 추가되었습니다

source: Course Updated Successfully
ar_eg: تم تحديث الدورة بنجاح
ko: 과정이 성공적으로 업데이트되었습니다

source: Course Deleted Successfully
ar_eg: تم حذف الدورة بنجاح
ko: 과정이 성공적으로 삭제되었습니다

source: Category Changed Successfully
ar_eg: تم تغيير الفئة بنجاح
ko: 카테고리가 성공적으로 변경되었습니다

# interviewBeforeCourse
source: Interview dates must be before course dates
ar_eg: يجب أن تكون مواعيد المقابلة قبل مواعيد الدورة
ko: 면접 날짜는 과정 날짜보다 먼저여야 합니다

source: Course Info
ar_eg: معلومات الدورة
ko: 과정 정보

# courseInfoDescription
source: Let's Start With Course Basic Info
ar_eg: لنبدأ بالمعلومات الأساسية للدورة
ko: 과정 기본 정보부터 시작하겠습니다

source: Course Goals
ar_eg: أهداف الدورة
ko: 과정 목표

# courseGoalsDescription
source: Set The Course Outcomes for Students
ar_eg: حدد النتائج المتوقعة للطلاب من الدورة
ko: 학생을 위한 과정 결과 설정

# courseGoalsNote
source: Note: you must set at least one goal
ar_eg: ملاحظة: يجب تحديد هدف واحد على الأقل
ko: 참고: 최소 하나의 목표를 설정해야 합니다

# goalLabel
source: Goal {goalNumber}
ar_eg: الهدف {goalNumber}
ko: 목표 {goalNumber}

# goalHint
source: Enter Goal {goalNumber}
ar_eg: أدخل الهدف {goalNumber}
ko: 목표 {goalNumber} 입력

source: Add Goal
ar_eg: إضافة هدف
ko: 목표 추가

source: Course Dates
ar_eg: تواريخ الدورة
ko: 과정 날짜

# courseDatesDescription
source: Now Let's set the Dates of the Course
ar_eg: الآن لنحدد تواريخ الدورة
ko: 이제 과정 날짜를 설정해보겠습니다

source: Course Image
ar_eg: صورة الدورة
ko: 과정 이미지

# courseImageDescription
source: Finally you can Add an Image to your course
ar_eg: أخيراً يمكنك إضافة صورة للدورة
ko: 마지막으로 과정에 이미지를 추가할 수 있습니다

# courseImageNote
source: Note: if you Don't add an image to the course the course will have the UCCD logo automatically
ar_eg: ملاحظة: إذا لم تضع صورة للدورة فستظهر شعار UCCD تلقائياً
ko: 참고: 과정에 이미지를 추가하지 않으면 자동으로 UCCD 로고가 표시됩니다

# addButtonLabel
source: Add
ar_eg: إضافة
ko: 추가

# editButtonLabel
source: Edit
ar_eg: تعديل
ko: 편집

# courseTitleLabel
source: Course Title
ar_eg: عنوان الدورة
ko: 과정 제목

# courseTitleHint
source: Enter Course Title
ar_eg: أدخل عنوان الدورة
ko: 과정 제목 입력

# descriptionLabel
source: Description
ar_eg: الوصف
ko: 설명

# descriptionHint
source: Enter Course Description
ar_eg: أدخل وصف الدورة
ko: 과정 설명 입력

# roomNumberLabel
source: Room Number
ar_eg: رقم القاعة
ko: 강의실 번호

# roomNumberHint
source: Enter Room Number
ar_eg: أدخل رقم القاعة
ko: 강의실 번호 입력

# durationLabel
source: Duration
ar_eg: المدة
ko: 기간

# durationHint
source: Enter Course Duration
ar_eg: أدخل مدة الدورة
ko: 과정 기간 입력

# courseStartDateLabel
source: Course Start Date
ar_eg: تاريخ بداية الدورة
ko: 과정 시작 날짜

# courseStartDateHint
source: Enter Course Start Date
ar_eg: أدخل تاريخ بداية الدورة
ko: 과정 시작 날짜 입력

# courseStartDateRequired
source: Start Date Required
ar_eg: تاريخ البداية مطلوب
ko: 시작 날짜 필수

# courseStartDateBeforeEndDate
source: Course Start Date must be before End Date
ar_eg: يجب أن يكون تاريخ بداية الدورة قبل تاريخ النهاية
ko: 과정 시작 날짜는 종료 날짜보다 이전이어야 합니다

# courseStartDateAfterInterviews
source: Course Start Date must be After Interviews
ar_eg: يجب أن يكون تاريخ بداية الدورة بعد المقابلات
ko: 과정 시작 날짜는 인터뷰 이후여야 합니다

# courseEndDateLabel
source: Course End Date
ar_eg: تاريخ نهاية الدورة
ko: 과정 종료 날짜

# courseEndDateHint
source: Enter Course End Date
ar_eg: أدخل تاريخ نهاية الدورة
ko: 과정 종료 날짜 입력

# courseEndDateRequired
source: End Date Required
ar_eg: تاريخ النهاية مطلوب
ko: 종료 날짜 필수

# courseEndDateAfterStartDate
source: Course End Date must be After Start Date
ar_eg: يجب أن يكون تاريخ نهاية الدورة بعد تاريخ البداية
ko: 과정 종료 날짜는 시작 날짜보다 이후여야 합니다

# courseEndDateAfterInterviews
source: Course End Date must be After Interviews
ar_eg: يجب أن يكون تاريخ نهاية الدورة بعد المقابلات
ko: 과정 종료 날짜는 인터뷰 이후여야 합니다

# loadingText
source: Loading
ar_eg: جاري التحميل
ko: 로딩 중

source: No Instructors Registered
ar_eg: لا يوجد مدربين مسجلين
ko: 등록된 강사가 없습니다

# instructorsLabel
source: Instructors
ar_eg: المدربين
ko: 강사들

source: Select One Instructor
ar_eg: اختر مدرب واحد
ko: 강사 한 명 선택

source: No Categories Registered
ar_eg: لا يوجد فئات مسجلة
ko: 등록된 카테고리가 없습니다

# categoriesLabel
source: Categories
ar_eg: الفئات
ko: 카테고리들

source: Select Category
ar_eg: اختر فئة
ko: 카테고리 선택

# tapToAddImage
source: Tab to Add Image
ar_eg: اضغط لإضافة صورة
ko: 탭하여 이미지 추가

# imageSizeLimit
source: Image Size limit is 10 MB
ar_eg: الحد الاقصي لحجم الصورة 10 ميجابايت
ko: 이미지 크기 제한은 10MB입니다

# deleteDialogTitle
source: Delete
ar_eg: حذف
ko: 삭제

# deleteButtonText
source: Delete
ar_eg: حذف
ko: 삭제

# logoutDialogTitle
source: Logout
ar_eg: تسجيل الخروج
ko: 로그아웃

# logoutButtonText
source: Logout
ar_eg: تسجيل الخروج
ko: 로그아웃

# deletePostTitle
source: Delete Post
ar_eg: حذف المنشور
ko: 게시물 삭제

# deletePostConfirmMessage
source: Are you sure you want to delete this post?
ar_eg: هل أنت متأكد من حذف هذا المنشور؟
ko: 이 게시물을 삭제하시겠습니까?

source: Cancel
ar_eg: إلغاء
ko: 취소

# universityIdLabel
source: University ID
ar_eg: الرقم الجامعي
ko: 학번

# nationalIdLabel
source: National ID
ar_eg: الرقم القومي
ko: 주민등록번호

# departmentLabel
source: Department
ar_eg: القسم
ko: 학과

# yearLabel
source: Year
ar_eg: السنة
ko: 학년

# genderLabel
source: Gender
ar_eg: الجنس
ko: 성별

# disabilityLabel
source: Disability
ar_eg: الإعاقة
ko: 장애

# phoneNumberLabel
source: Phone Number
ar_eg: رقم الهاتف
ko: 전화번호

# graduationYearLabel
source: Graduation Year
ar_eg: سنة التخرج
ko: 졸업년도

source: Archive Panel
ar_eg: لوحة الأرشيف
ko: 아카이브 패널

# archiveStatisticsTooltip
source: View archived course statistics and analytics
ar_eg: عرض إحصائيات وتحليلات الدورة المؤرشفة
ko: 아카이브된 과정 통계 및 분석 보기

# archiveStatisticsSemanticLabel
source: View statistics for archived course {courseName}
ar_eg: عرض إحصائيات الدورة المؤرشفة {courseName}
ko: 아카이브된 과정 {courseName} 통계 보기

# courseStudentsTooltip
source: View archived course students
ar_eg: عرض طلاب الدورة المؤرشفة
ko: 아카이브된 과정 학생들 보기

# courseStudentsSemanticLabel
source: View students for {courseName}
ar_eg: عرض طلاب {courseName}
ko: {courseName} 학생들 보기

# courseRatingsTooltip
source: View course ratings and feedback
ar_eg: عرض تقييمات وملاحظات الدورة
ko: 과정 평점 및 피드백 보기

# courseRatingsSemanticLabel
source: View ratings for {courseName}
ar_eg: عرض تقييمات {courseName}
ko: {courseName} 평점 보기

# totalDays
source: Total: {days} Days
ar_eg: المجموع: {days} أيام
ko: 총: {days}일

# attendedDays
source: Attended: {count}
ar_eg: الحضور: {count}
ko: 출석: {count}

# absentDays
source: Absent: {count}
ar_eg: الغياب: {count}
ko: 결석: {count}

# absenceDaysTitle
source: Absence Days
ar_eg: أيام الغياب
ko: 결석일

# enrollmentSuccess
source: Successfully enrolled in {courseName}
ar_eg: تم التسجيل بنجاح في {courseName}
ko: {courseName}에 성공적으로 등록되었습니다

# enrollmentError
source: Error: {errorMessage}
ar_eg: خطأ: {errorMessage}
ko: 오류: {errorMessage}

source: No goals provided
ar_eg: لم يتم تحديد أهداف
ko: 제공된 목표가 없습니다

# advancedCourse
source: Advanced {category}
ar_eg: {category} متقدم
ko: 고급 {category}

# beginnerCourse
source: {category} for Beginners
ar_eg: {category} للمبتدئين
ko: 초보자를 위한 {category}

# ratingsTitle
source: Ratings
ar_eg: التقييمات
ko: 평점

# allRatings
source: All
ar_eg: الكل
ko: 전체

# fiveStars
source: 5 Stars
ar_eg: 5 نجوم
ko: 5점

# fourStars
source: 4 Stars
ar_eg: 4 نجوم
ko: 4점

# threeStars
source: 3 Stars
ar_eg: 3 نجوم
ko: 3점

# twoStars
source: 2 Stars
ar_eg: نجمتان
ko: 2점

# oneStar
source: 1 Star
ar_eg: نجمة واحدة
ko: 1점

source: No ratings yet
ar_eg: لا توجد تقييمات بعد
ko: 아직 평점이 없습니다

# noRatingsMessage
source: This course hasn't received any ratings yet.
ar_eg: لم تحصل هذه الدورة على أي تقييمات بعد.
ko: 이 과정은 아직 평점을 받지 못했습니다.

source: Error loading ratings
ar_eg: خطأ في تحميل التقييمات
ko: 평점 로딩 오류

source: Rating Overview
ar_eg: نظرة عامة على التقييمات
ko: 평점 개요

# overallRating
source: Overall
ar_eg: إجمالي
ko: 전체

# contentRating
source: Content
ar_eg: المحتوى
ko: 내용

# instructorRating
source: Instructor
ar_eg: المدرب
ko: 강사

# reviewsCount
source: {count} reviews
ar_eg: {count} تقييم
ko: {count}개 리뷰

source: No reviews yet
ar_eg: لا توجد تقييمات بعد
ko: 아직 리뷰가 없습니다

# showingOneReview
source: Showing 1 review
ar_eg: عرض تقييم واحد
ko: 1개 리뷰 표시

# showingMultipleReviews
source: Showing {count} reviews
ar_eg: عرض {count} تقييم
ko: {count}개 리뷰 표시

# noFilteredReviews
source: No {filter} reviews
ar_eg: لا توجد تقييمات {filter}
ko: {filter} 리뷰가 없습니다

# showingOneFilteredReview
source: Showing 1 {filter} review
ar_eg: عرض تقييم واحد {filter}
ko: 1개 {filter} 리뷰 표시

# showingMultipleFilteredReviews
source: Showing {count} {filter} reviews
ar_eg: عرض {count} تقييم {filter}
ko: {count}개 {filter} 리뷰 표시

source: Loading User Name
ar_eg: جاري تحميل اسم المستخدم
ko: 사용자 이름 로딩 중

# loadingComment
source: Loading comment text that will be replaced with actual content...
ar_eg: جاري تحميل نص التعليق الذي سيتم استبداله بالمحتوى الفعلي...
ko: 실제 내용으로 대체될 댓글 텍스트를 로딩 중...

source: Review
ar_eg: تقييم
ko: 리뷰

# enrollmentFull
source: Full
ar_eg: مكتملة
ko: 정원 마감

# enrollmentAlmostFull
source: Almost full!
ar_eg: تكاد تكتمل!
ko: 거의 마감!

# enrollmentFillingUp
source: Filling up
ar_eg: تمتلئ
ko: 마감 임박

# enrollmentSpotsAvailable
source: Spots available
ar_eg: أماكن متاحة
ko: 여석 있음

# courseStatsDuration
source: Duration
ar_eg: المدة
ko: 기간

# courseStatsRoom
source: Room
ar_eg: القاعة
ko: 강의실

# courseStatsLength
source: Length
ar_eg: المهلة
ko: 수업 기간

# courseStatsPrerequisites
source: Prerequisites
ar_eg: المتطلبات المسبقة
ko: 선수과목

# courseStatsDurationValue
source: {hours} hrs
ar_eg: {hours} ساعة
ko: {hours}시간

# courseStatsLengthValue
source: {weeks} weeks
ar_eg: {weeks} أسبوع
ko: {weeks}주

# courseScheduleTitle
source: Course Schedule
ar_eg: جدول الدورة
ko: 과정 일정

# relatedCoursesTitle
source: Related Courses
ar_eg: الدورات ذات الصلة
ko: 관련 과정

# instructorTitle
source: Instructor
ar_eg: المدرب
ko: 강사

# aboutThisCourseTitle
source: About This Course
ar_eg: حول هذه الدورة
ko: 이 과정에 대하여

# confirmEnrollmentTitle
source: Confirm Enrollment
ar_eg: تأكيد التسجيل
ko: 등록 확인

# confirmEnrollmentMessage
source: You are about to enroll in {courseName}.
ar_eg: أنت على وشك التسجيل في {courseName}.
ko: {courseName}에 등록하려고 합니다.

# interviewPeriodLabel
source: Interview Period: {startDate} - {endDate}
ar_eg: فترة المقابلة: {startDate} - {endDate}
ko: 면접 기간: {startDate} - {endDate}

# coursePeriodLabel
source: Course Period: {startDate} - {endDate}
ar_eg: فترة الدورة: {startDate} - {endDate}
ko: 과정 기간: {startDate} - {endDate}

# confirmButton
source: Confirm
ar_eg: تأكيد
ko: 확인

# enrollNowButton
source: Enroll Now
ar_eg: سجل الآن
ko: 지금 등록

# courseTimelineTitle
source: Course Timeline
ar_eg: الجدول الزمني للدورة
ko: 과정 일정표

# interviewPeriodTitle
source: Interview Period
ar_eg: فترة المقابلة
ko: 면접 기간

# coursePeriodTitle
source: Course Period
ar_eg: فترة الدورة
ko: 과정 기간

# instructorLabel
source: Instructor: {name}
ar_eg: المدرب: {name}
ko: 강사: {name}

# viewCourseButton
source: View Course
ar_eg: عرض الدورة
ko: 과정 보기

# SkillsAndPrerequisites
source: Skills & Prerequisites
ar_eg: المهارات والمتطلبات المسبقة
ko: 기술 및 전제 조건

source: What You Will Learn
ar_eg: ماذا ستتعلم
ko: 당신이 배울 것
