Repository: AhmedAbdElrahman117/uccd
Catalog: lib/l10n/intl_*.arb
Languages: ar_eg, ko

# interviewPeriodSubtitle
source: Interview starts on {startDate} and ends on {endDate}
ar_eg: تبدأ المقابلة في {startDate} وتنتهي في {endDate}
ko: 면접은 {startDate}에 시작하여 {endDate}에 종료됩니다

# coursePeriodSubtitle
source: Course runs from {startDate} to {endDate}
ar_eg: تمتد الدورة من {startDate} إلى {endDate}
ko: 과정은 {startDate}부터 {endDate}까지 진행됩니다

# communityTitle
source: Community
ar_eg: المجتمع
ko: 커뮤니티

# communitySubtitle
source: Follow Events of UCCD Center
ar_eg: تابع أحداث مركز UCCD
ko: UCCD 센터의 이벤트를 팔로우하세요

# likeButtonLabel
source: Like
ar_eg: إعجاب
ko: 좋아요

# commentsButtonLabel
source: Comments
ar_eg: التعليقات
ko: 댓글

# editPostOption
source: Edit Post
ar_eg: تعديل المنشور
ko: 게시물 편집

# deletePostOption
source: Delete Post
ar_eg: حذف المنشور
ko: 게시물 삭제

# createPostDialogTitle
source: Create Post
ar_eg: إنشاء منشور
ko: 게시물 작성

# editPostDialogTitle
source: Edit Post
ar_eg: تعديل المنشور
ko: 게시물 편집

# postContentHint
source: What's on your mind?
ar_eg: ما الذي تفكر فيه؟
ko: 무슨 생각을 하고 계신가요?

# editPostContentHint
source: Edit your post...
ar_eg: عدل منشورك...
ko: 게시물을 편집하세요...

# postButtonLabel
source: Post
ar_eg: نشر
ko: 게시

# updateButtonLabel
source: Update
ar_eg: تحديث
ko: 업데이트

# cancelButtonLabel
source: Cancel
ar_eg: إلغاء
ko: 취소

# postContentEmpty
source: Post content cannot be empty
ar_eg: محتوى المنشور لا يمكن أن يكون فارغاً
ko: 게시물 내용이 비어있을 수 없습니다

# failedToPickImage
source: Failed to pick image: {error}
ar_eg: فشل في اختيار الصورة: {error}
ko: 이미지 선택 실패: {error}

# removeImageTooltip
source: Remove image
ar_eg: إزالة الصورة
ko: 이미지 제거

# closeDialogTooltip
source: Close dialog
ar_eg: إغلاق النافذة
ko: 대화상자 닫기

# pickImageTooltip
source: Pick image
ar_eg: اختيار صورة
ko: 이미지 선택

source: No posts yet
ar_eg: لا توجد منشورات بعد
ko: 아직 게시물이 없습니다

# beFirstToShare
source: Be the first to share something with the community!
ar_eg: كن أول من يشارك شيئاً مع المجتمع!
ko: 커뮤니티와 처음으로 무언가를 공유해보세요!

# createPostButton
source: Create Post
ar_eg: إنشاء منشور
ko: 게시물 작성

source: No comments yet
ar_eg: لا توجد تعليقات بعد
ko: 아직 댓글이 없습니다

# beFirstToComment
source: Be the first to comment on this post!
ar_eg: كن أول من يعلق على هذا المنشور!
ko: 이 게시물에 첫 번째로 댓글을 달아보세요!

# commentsTitle
source: Comments
ar_eg: التعليقات
ko: 댓글

# addCommentHint
source: Add a comment...
ar_eg: أضف تعليقاً...
ko: 댓글을 추가하세요...

# commentValidationEmpty
source: Please enter a comment
ar_eg: من فضلك أدخل تعليقاً
ko: 댓글을 입력해주세요

# commentValidationTrimmed
source: Comment cannot be empty
ar_eg: التعليق لا يمكن أن يكون فارغاً
ko: 댓글이 비어있을 수 없습니다

# errorLoadingComments
source: Error loading comments: {error}
ar_eg: خطأ في تحميل التعليقات: {error}
ko: 댓글 로딩 오류: {error}

source: Likes: {count}
ar_eg: الإعجابات: {count}
ko: 좋아요: {count}

source: Comments: {count}
ar_eg: التعليقات: {count}
ko: 댓글: {count}

source: Post
ar_eg: نشر
ko: 우편

source: Admin Features
ar_eg: ميزات المشرف
ko: 관리자 기능

source: Account
ar_eg: الحساب
ko: 계정

source: Language
ar_eg: اللغة
ko: 언어

source: Dark Mode
ar_eg: الوضع المظلم
ko: 다크 모드

source: Users
ar_eg: المستخدمون
ko: 사용자

source: Logs
ar_eg: السجلات
ko: 로그

source: No Logs in This Day
ar_eg: لا توجد سجلات في هذا اليوم
ko: 이 날에는 로그가 없습니다

source: Logout
ar_eg: تسجيل الخروج
ko: 로그아웃

# logoutConfirmation
source: Are you sure you want to Logout
ar_eg: هل أنت متأكد أنك تريد تسجيل الخروج
ko: 로그아웃하시겠습니까

source: Arabic
ar_eg: العربية
ko: 아랍어

source: English
ar_eg: الإنجليزية
ko: 영어

source: Korean
ar_eg: الكورية
ko: 한국어

# roleStudent
source: Student
ar_eg: طالب
ko: 학생

# roleInstructor
source: Instructor
ar_eg: مدرب
ko: 강사

# roleAdmin
source: Admin
ar_eg: مشرف
ko: 관리자

# roleSuperAdmin
source: Super Admin
ar_eg: مشرف عام
ko: 수퍼 관리자

# addStudentTitle
source: Add Student
ar_eg: إضافة طالب
ko: 학생 추가

# editStudentTitle
source: Edit Student
ar_eg: تعديل طالب
ko: 학생 편집

# addInstructorTitle
source: Add Instructor
ar_eg: إضافة مدرب
ko: 강사 추가

# editInstructorTitle
source: Edit Instructor
ar_eg: تعديل مدرب
ko: 강사 편집

# addAdminTitle
source: Add Admin
ar_eg: إضافة مشرف
ko: 관리자 추가

# editAdminTitle
source: Edit Admin
ar_eg: تعديل مشرف
ko: 관리자 편집

# studentNameLabel
source: Student Name
ar_eg: اسم الطالب
ko: 학생 이름

# studentNameHint
source: Enter student name
ar_eg: أدخل اسم الطالب
ko: 학생 이름을 입력하세요

# instructorNameLabel
source: Instructor Name
ar_eg: اسم المدرب
ko: 강사 이름

# instructorNameHint
source: Enter instructor name
ar_eg: أدخل اسم المدرب
ko: 강사 이름을 입력하세요

# adminNameLabel
source: Admin Name
ar_eg: اسم المشرف
ko: 관리자 이름

# adminNameHint
source: Enter admin username
ar_eg: أدخل اسم المستخدم للمشرف
ko: 관리자 사용자명을 입력하세요

# studentEmailLabel
source: Student Email
ar_eg: بريد الطالب
ko: 학생 이메일

# studentEmailHint
source: Enter Student Email
ar_eg: أدخل بريد الطالب
ko: 학생 이메일을 입력하세요

# instructorEmailLabel
source: Instructor Email
ar_eg: بريد المدرب
ko: 강사 이메일

# instructorEmailHint
source: Enter instructor email
ar_eg: أدخل بريد المدرب
ko: 강사 이메일을 입력하세요

# adminEmailLabel
source: Admin Email
ar_eg: بريد المشرف
ko: 관리자 이메일

# adminEmailHint
source: Enter admin email
ar_eg: أدخل بريد المشرف
ko: 관리자 이메일을 입력하세요

# studentPasswordLabel
source: Student Password
ar_eg: كلمة مرور الطالب
ko: 학생 비밀번호

# instructorPasswordLabel
source: Instructor Password
ar_eg: كلمة مرور المدرب
ko: 강사 비밀번호

# adminPasswordLabel
source: Admin Password
ar_eg: كلمة مرور المشرف
ko: 관리자 비밀번호

# universityIdHint
source: Enter Student University ID
ar_eg: أدخل الرقم الجامعي للطالب
ko: 학생 학번을 입력하세요

# nationalIdHint
source: Enter National ID
ar_eg: أدخل الرقم القومي
ko: 주민등록번호를 입력하세요

source: Student Email Required
ar_eg: بريد الطالب مطلوب
ko: 학생 이메일 필수

source: University Emails Only
ar_eg: البريد الجامعي فقط
ko: 대학 이메일만

source: University ID Required
ar_eg: الرقم الجامعي مطلوب
ko: 학번 필수

source: National ID Required
ar_eg: الرقم القومي مطلوب
ko: 주민등록번호 필수

source: Password Required
ar_eg: كلمة المرور مطلوبة
ko: 비밀번호 필수

# usernameRequired
source: Please enter a username
ar_eg: من فضلك أدخل اسم المستخدم
ko: 사용자명을 입력하세요

source: Admin Added Successfully
ar_eg: تم إضافة المشرف بنجاح
ko: 관리자가 성공적으로 추가되었습니다

source: Admin Updated Successfully
ar_eg: تم تحديث المشرف بنجاح
ko: 관리자가 성공적으로 업데이트되었습니다

source: Instructor Added Successfully
ar_eg: تم إضافة المدرب بنجاح
ko: 강사가 성공적으로 추가되었습니다

source: Instructor Updated Successfully
ar_eg: تم تحديث المدرب بنجاح
ko: 강사가 성공적으로 업데이트되었습니다

source: Student Added Successfully
ar_eg: تم إضافة الطالب بنجاح
ko: 학생이 성공적으로 추가되었습니다

source: Student Updated Successfully
ar_eg: تم تحديث الطالب بنجاح
ko: 학생이 성공적으로 업데이트되었습니다

# universityIdLengthError
source: University ID must be 9 characters length
ar_eg: يجب أن يكون الرقم الجامعي 9 أرقام
ko: 학번은 9자리여야 합니다

source: Student Name Required
ar_eg: اسم الطالب مطلوب
ko: 학생 이름 필수

# nationalIdLengthError
source: National ID must be 14 characters length
ar_eg: يجب أن يكون الرقم القومي 14 رقم
ko: 주민등록번호는 14자리여야 합니다

# studentPasswordHint
source: Enter Student Password
ar_eg: أدخل كلمة مرور الطالب
ko: 학생 비밀번호 입력

# departmentHint
source: Department
ar_eg: القسم
ko: 학과

source: Select Department
ar_eg: اختر القسم
ko: 학과 선택

# yearHint
source: year
ar_eg: السنة
ko: 학년

source: Select year
ar_eg: اختر السنة
ko: 학년 선택

source: Information Technology
ar_eg: تكنولوجيا المعلومات
ko: 정보기술

source: Mechatronics
ar_eg: الميكاترونيكس
ko: 메카트로닉스

source: Autotronics
ar_eg: الأوتوترونيكس
ko: 오토트로닉스

source: Renewable Energy
ar_eg: الطاقة المتجددة
ko: 재생에너지

# orthoticsProsthetics
source: O&P
ar_eg: الأطراف والأجهزة التعويضية
ko: 보조기구 및 의지학

# instructorPasswordHint
source: Enter Instructor Password
ar_eg: أدخل كلمة مرور المدرب
ko: 강사 비밀번호 입력

source: Name Required
ar_eg: الاسم مطلوب
ko: 이름이 필요합니다

# browseCoursesHint
source: Browse available courses and enroll to see them here
ar_eg: تصفح الدورات المتاحة واشترك لتراها هنا
ko: 사용 가능한 과정을 찾아보고 등록하여 여기에서 확인하세요

source: Browse Courses
ar_eg: تصفح الدورات
ko: 과정 찾아보기

# tryChangingFilters
source: Try changing your filters or search terms
ar_eg: جرب تغيير المرشحات أو مصطلحات البحث
ko: 필터나 검색어를 변경해 보세요

# coursesWillAppear
source: Courses will appear here once they are available
ar_eg: ستظهر الدورات هنا بمجرد توفرها
ko: 과정이 사용 가능해지면 여기에 나타납니다

source: Show All Courses
ar_eg: عرض جميع الدورات
ko: 모든 과정 보기

source: Upload Course Materials
ar_eg: رفع مواد الدورة
ko: 과정 자료 업로드

# skillsAndPrerequisitesDescription
source: What are the skills and Prerequisites required from the student
ar_eg: ما هي المهارات والمتطلبات المسبقة المطلوبة من الطالب
ko: 학생에게 필요한 기술과 전제 조건은 무엇입니까

# prerequisitesNote
source: Note: Define at least one skill or prerequisite
ar_eg: ملاحظة: حدد مهارة واحدة أو متطلب مسبق واحد على الأقل
ko: 참고: 최소 하나의 기술 또는 전제 조건을 정의하세요

# prerequisitesNoneNote
source: Note: if you don't have any skills or prerequisites, you can Write "None" in the field below
ar_eg: ملاحظة: إذا لم تكن لديك أي مهارات أو متطلبات مسبقة، يمكنك كتابة "لا يوجد" في الحقل أدناه
ko: 참고: 기술이나 전제 조건이 없는 경우 아래 필드에 "없음"이라고 쓸 수 있습니다

# prerequisiteSkillLabel
source: Prerequisites/Skill {number}
ar_eg: المتطلبات المسبقة/المهارة {number}
ko: 전제 조건/기술 {number}

# prerequisiteSkillHint
source: Say something about this Prerequisites/Skill
ar_eg: قل شيئاً عن هذه المتطلبات المسبقة/المهارة
ko: 이 전제 조건/기술에 대해 말해보세요

# prerequisiteFieldRequired
source: This field cannot be empty
ar_eg: هذا الحقل لا يمكن أن يكون فارغاً
ko: 이 필드는 비워둘 수 없습니다

source: Add Prerequisite/Skill
ar_eg: إضافة متطلب مسبق/مهارة
ko: 전제 조건/기술 추가

source: Email Already in Use
ar_eg: البريد الإلكتروني مستخدم بالفعل
ko: 이메일이 이미 사용 중입니다

# authInvalidEmail
source: Invalid Email
ar_eg: بريد إلكتروني غير صحيح
ko: 유효하지 않은 이메일

# emailNotEnabled
source: Email is Not Enabled Contact Support
ar_eg: البريد الإلكتروني غير مفعل، تواصل مع الدعم
ko: 이메일이 활성화되지 않음, 지원팀에 문의하세요

source: Try Again Later
ar_eg: حاول مرة أخرى لاحقاً
ko: 나중에 다시 시도하세요

# checkInternetConnection
source: Check Your Internet Connection And Try Again Later
ar_eg: تحقق من اتصالك بالإنترنت وحاول مرة أخرى لاحقاً
ko: 인터넷 연결을 확인하고 나중에 다시 시도하세요

# userAccountDisabled
source: User Account is Disabled Contact Support
ar_eg: حساب المستخدم معطل، تواصل مع الدعم
ko: 사용자 계정이 비활성화됨, 지원팀에 문의하세요

source: No Such Email Found
ar_eg: لم يتم العثور على هذا البريد الإلكتروني
ko: 해당 이메일을 찾을 수 없습니다

source: Wrong Password
ar_eg: كلمة مرور خاطئة
ko: 잘못된 비밀번호

# emailOrPasswordInvalid
source: Email Or Password is Invalid
ar_eg: البريد الإلكتروني أو كلمة المرور غير صحيحة
ko: 이메일 또는 비밀번호가 유효하지 않습니다

source: Unknown Error
ar_eg: خطأ غير معروف
ko: 알 수 없는 오류

source: Connection Timeout
ar_eg: انتهت مهلة الاتصال
ko: 연결 시간 초과

source: No User
ar_eg: لا يوجد مستخدم
ko: 사용자 없음

# noUserFoundContactSupport
source: No User Found Please Contact Support
ar_eg: لم يتم العثور على مستخدم يرجى التواصل مع الدعم
ko: 사용자를 찾을 수 없습니다 지원팀에 문의하세요

source: Error
ar_eg: خطأ
ko: 오류

source: Success
ar_eg: نجح
ko: 성공

source: Code Resent
ar_eg: تم إعادة إرسال الرمز
ko: 코드가 다시 전송됨

source: Failed
ar_eg: فشل
ko: 실패

# passwordLengthError
source: Password must be at least 8 characters
ar_eg: يجب أن تكون كلمة المرور 8 أحرف على الأقل
ko: 비밀번호는 최소 8자 이상이어야 합니다

source: Nothing to Edit
ar_eg: لا يوجد شيء لتعديله
ko: 편집할 것이 없습니다

# addCategoryTitle
source: Add Category
ar_eg: إضافة فئة
ko: 카테고리 추가

# editCategoryTitle
source: Edit Category
ar_eg: تعديل فئة
ko: 카테고리 편집

# categoryNameLabel
source: Category Name
ar_eg: اسم الفئة
ko: 카테고리 이름

# categoryNameHint
source: Enter Category Name
ar_eg: أدخل اسم الفئة
ko: 카테고리 이름을 입력하세요

source: Category Name Required
ar_eg: اسم الفئة مطلوب
ko: 카테고리 이름이 필요합니다

source: No Registered Categories
ar_eg: لا توجد فئات مسجلة
ko: 등록된 카테고리가 없습니다

# deleteCategoryConfirmation
source: Are you sure you want to delete "{categoryName}"? *This action cannot be undone.
ar_eg: هل أنت متأكد من حذف "{categoryName}"? *لا يمكن التراجع عن هذا الإجراء.
ko: "{categoryName}"을(를) 삭제하시겠습니까? *이 작업은 되돌릴 수 없습니다.

source: Categories Overview
ar_eg: نظرة عامة على الفئات
ko: 카테고리 개요

# categoryAvailable
source: {count} {count, plural, =1{category} other{categories}} available
ar_eg: {count} {count, plural, =1{فئة} other{فئات}} متاحة
ko: {count}개 카테고리 사용 가능

# manageCategoriesEfficiently
source: Manage your categories efficiently
ar_eg: إدارة فئاتك بكفاءة
ko: 카테고리를 효율적으로 관리하세요

source: Created On
ar_eg: تم الإنشاء في
ko: 생성됨

# categoryUsageInfo
source: This category can be used to organize courses and content.
ar_eg: يمكن استخدام هذه الفئة لتنظيم الدورات والمحتوى.
ko: 이 카테고리는 강좌와 콘텐츠를 정리하는 데 사용할 수 있습니다.

source: Recent Courses
ar_eg: الدورات الحديثة
ko: 최근 과정

source: Current Year
ar_eg: السنة الحالية
ko: 현재 학년

source: Department
ar_eg: القسم
ko: 학과

source: In Progress
ar_eg: قيد التقدم
ko: 진행 중

source: No courses in progress
ar_eg: لا توجد دورات قيد التقدم
ko: 진행 중인 과정이 없습니다

source: Failed to load courses
ar_eg: فشل في تحميل الدورات
ko: 과정 로딩 실패

source: No courses available
ar_eg: لا توجد دورات متاحة
ko: 사용 가능한 과정이 없습니다

# welcomeBackComma
source: Welcome back,
ar_eg: أهلاً بعودتك،
ko: 환영합니다,

source: Continue learning journey
ar_eg: تابع رحلة التعلم
ko: 학습 여정을 계속하세요

source: View All
ar_eg: عرض الكل
ko: 모두 보기

source: Enroll
ar_eg: التسجيل
ko: 등록

# checkInternetConnectionAndTryAgain
source: Check your Internet Connection and try again
ar_eg: تحقق من اتصالك بالإنترنت وحاول مرة أخرى
ko: 인터넷 연결을 확인하고 다시 시도하세요

# connectionTimeoutTryAgain
source: Connection Timeout Try Again Later
ar_eg: انتهت مهلة الاتصال، حاول مرة أخرى لاحقاً
ko: 연결 시간 초과, 나중에 다시 시도하세요

source: Enrolled in This Category
ar_eg: مسجل في هذه الفئة
ko: 이 카테고리에 등록됨

# courseFull
source: Full
ar_eg: مكتمل
ko: 가득 참

source: Enroll Now
ar_eg: سجل الآن
ko: 지금 등록

source: User Created Successfully
ar_eg: تم إنشاء المستخدم بنجاح
ko: 사용자가 성공적으로 생성되었습니다

source: User Deleted Successfully
ar_eg: تم حذف المستخدم بنجاح
ko: 사용자가 성공적으로 삭제되었습니다

source: User Updated Successfully
ar_eg: تم تحديث المستخدم بنجاح
ko: 사용자가 성공적으로 업데이트되었습니다

source: Instructor Created Successfully
ar_eg: تم إنشاء المدرس بنجاح
ko: 강사가 성공적으로 생성되었습니다

source: Instructor Deleted Successfully
ar_eg: تم حذف المدرس بنجاح
ko: 강사가 성공적으로 삭제되었습니다

source: Category Added Successfully
ar_eg: تم إضافة الفئة بنجاح
ko: 카테고리가 성공적으로 추가되었습니다

source: Category Deleted Successfully
ar_eg: تم حذف الفئة بنجاح
ko: 카테고리가 성공적으로 삭제되었습니다

source: Category Updated Successfully
ar_eg: تم تحديث الفئة بنجاح
ko: 카테고리가 성공적으로 업데이트되었습니다

source: Post Added Successfully
ar_eg: تم إضافة المنشور بنجاح
ko: 게시물이 성공적으로 추가되었습니다

source: Post Deleted Successfully
ar_eg: تم حذف المنشور بنجاح
ko: 게시물이 성공적으로 삭제되었습니다

source: Post Updated Successfully
ar_eg: تم تحديث المنشور بنجاح
ko: 게시물이 성공적으로 업데이트되었습니다

source: Comment Added Successfully
ar_eg: تم إضافة التعليق بنجاح
ko: 댓글이 성공적으로 추가되었습니다

source: No Internet Connection
ar_eg: لا يوجد اتصال بالإنترنت
ko: 인터넷 연결이 없습니다

source: Registration Failed
ar_eg: فشل التسجيل
ko: 등록 실패

source: Try Again
ar_eg: حاول مرة أخرى
ko: 다시 시도

# failedToLoadData
source: Failed to retrieve Data
ar_eg: فشل في استرداد البيانات
ko: 데이터 검색 실패

# failedToLoadCoursesWithHelp
source: Failed to load courses. Please check your internet connection and try again.
ar_eg: فشل في تحميل الدورات. يرجى التحقق من اتصالك بالإنترنت والمحاولة مرة أخرى.
ko: 코스를 로드하지 못했습니다. 인터넷 연결을 확인하고 다시 시도하세요.

source: Search courses...
ar_eg: البحث في الدورات...
ko: 코스 검색...

source: No courses found
ar_eg: لم يتم العثور على دورات
ko: 코스를 찾을 수 없습니다

source: Instructor
ar_eg: المدرب
ko: 강사

source: Starts
ar_eg: يبدأ
ko: 시작

source: Ended
ar_eg: انتهت
ko: 종료됨

source: Ends
ar_eg: تنتهي
ko: 종료

source: Completed
ar_eg: مكتملة
ko: 완료됨

# myCoursesTitle
source: My Courses
ar_eg: دوراتي
ko: 내 과정

source: Rate Course
ar_eg: تقييم الدورة
ko: 과정 평가

source: Your Progress
ar_eg: تقدمك
ko: 당신의 진도

# trackEnrolledCourses
source: Track your enrolled courses and progress
ar_eg: تتبع الدورات المسجلة والتقدم
ko: 등록된 과정과 진도를 추적하세요

source: No enrolled courses
ar_eg: لا توجد دورات مسجلة
ko: 등록된 과정이 없습니다

source: Notification Sent Successfully
ar_eg: تم إرسال الإشعار بنجاح
ko: 알림이 성공적으로 전송되었습니다

source: Hour
ar_eg: ساعة
ko: 시간

source: Coming Soon
ar_eg: قريباً
ko: 곧 출시 예정

# ComingSoonlabel
source: This feature is coming soon!
ar_eg: هذا القسم قيد التطوير وسيتم إطلاقه قريباً. شكراً لصبرك!
ko: 이 기능은 곧 출시됩니다!

# selectDateAttendance
source: Select Date for Attendance
ar_eg: اختر تاريخ الحضور
ko: 출석 날짜 선택

source: Students ({count})
ar_eg: الطلاب ({count})
ko: 학생 ({count})

# dateLabel
source: Date: {date}
ar_eg: التاريخ: {date}
ko: 날짜: {date}

source: Present: {count}
ar_eg: الحضور: {count}
ko: 출석: {count}

source: Absent: {count}
ar_eg: الغياب: {count}
ko: 결석: {count}

source: Unmarked: {count}
ar_eg: غير محدد: {count}
ko: 미표시: {count}

# selectTodayDateAttendance
source: Please select today's date to view attendance
ar_eg: يرجى اختيار تاريخ اليوم لعرض الحضور
ko: 출석을 보려면 오늘 날짜를 선택하세요

# attendanceOnlyToday
source: Attendance is only available for today's date
ar_eg: الحضور متاح فقط لتاريخ اليوم
ko: 출석은 오늘 날짜에만 가능합니다

source: Selected: {date}
ar_eg: المحدد: {date}
ko: 선택됨: {date}

# monthJan
source: Jan
ar_eg: يناير
ko: 1월

# monthFeb
source: Feb
ar_eg: فبراير
ko: 2월

# monthMar
source: Mar
ar_eg: مارس
ko: 3월

# monthApr
source: Apr
ar_eg: أبريل
ko: 4월

# monthMay
source: May
ar_eg: مايو
ko: 5월

# monthJun
source: Jun
ar_eg: يونيو
ko: 6월

# monthJul
source: Jul
ar_eg: يوليو
ko: 7월

# monthAug
source: Aug
ar_eg: أغسطس
ko: 8월

# monthSep
source: Sep
ar_eg: سبتمبر
ko: 9월

# monthOct
source: Oct
ar_eg: أكتوبر
ko: 10월

# monthNov
source: Nov
ar_eg: نوفمبر
ko: 11월

# monthDec
source: Dec
ar_eg: ديسمبر
ko: 12월

# failedToSaveAttendance
source: Failed to save attendance: {errorMessage}
ar_eg: فشل في حفظ الحضور: {errorMessage}
ko: 출석 저장 실패: {errorMessage}

source: Error loading students
ar_eg: خطأ في تحميل الطلاب
ko: 학생 로딩 오류

source: No students enrolled
ar_eg: لا يوجد طلاب مسجلين
ko: 등록된 학생 없음

# studentsWillAppearEnrolled
source: Students will appear here once they are enrolled in the course
ar_eg: سيظهر الطلاب هنا بمجرد تسجيلهم في الدورة
ko: 학생들이 과정에 등록되면 여기에 표시됩니다

# attendanceOnlyTodayDate
source: Attendance can only be marked for today's date
ar_eg: يمكن تسجيل الحضور فقط لتاريخ اليوم
ko: 출석은 오늘 날짜에만 표시할 수 있습니다

# studentMarkedPresent
source: Student marked as present
ar_eg: تم تسجيل الطالب كحاضر
ko: 학생이 출석으로 표시됨

# studentMarkedAbsent
source: Student marked as absent
ar_eg: تم تسجيل الطالب كغائب
ko: 학생이 결석으로 표시됨

source: Student attendance unmarked
ar_eg: تم إلغاء تسجيل حضور الطالب
ko: 학생 출석이 표시 해제됨

source: Room
ar_eg: القاعة
ko: 강의실

source: Present
ar_eg: حضور
ko: 현재의

source: Absent
ar_eg: غياب
ko: 결석한

source: Unmarked
ar_eg: غير محدد
ko: 표시되지 않음
